app/Controllers/ItemDetails.php

    public function checkTmpRFID()
    {
        $model = new ItemModel();
        $tmpRFIDModel = new tmpRFID(); // Use the TmpRFIDModel

        // Fetch the latest tmpUID from the tmpRFID table
        $tmpUID = $tmpRFIDModel->orderBy('created_at', 'DESC')->first(); // Adjust the order by column as needed
---
SELECT *
FROM `tmpRFID`
ORDER BY `created_at` DESC
 LIMIT 1